app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "_9L8hg7XPr_ATif60c1tXw"], ["updated_at", "2021-10-26 20:52:25.389986"], ["id", 2]]
---
   def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save